# SQL Miniproject

## Introduction

The city of New York does restaurant inspections and assigns a grade. Inspections data for various years are available on s3 as an SQLite database, which you can import in the next few cells. These were extracted from a set of CSV files and an XLS file, as described in the <b>How we loaded the data</b> section

The raw data can be found [here](https://s3.amazonaws.com/dataincubator-course/coursedata/nyc_inspection_data.zip) and can be useful to look at. The file `RI_Webextract_BigApps_Latest.xls` contains a description of each of the data files and what the columns mean.

In [3]:
#This will load the pre-existing tables
%load_ext sql
# %reload_ext sql
%sql postgresql://docker:docker@nycinspection.tditrain.com:5433/NYCinspection

To see what tables are in the database:

In [4]:
%%sql

SELECT table_name FROM information_schema.tables
WHERE table_schema = 'public';

 * postgresql://docker:***@nycinspection.tditrain.com:5433/NYCinspection
4 rows affected.

[('webextract',), ('violations',), ('cuisine',), ('boroughs',)]

And to look at the format of an individual table (note that you may need to change types to get the answers in the right form):

In [5]:
%%sql

SELECT column_name, data_type FROM information_schema.columns
WHERE table_name = 'cuisine'
ORDER BY ordinal_position;

 * postgresql://docker:***@nycinspection.tditrain.com:5433/NYCinspection
2 rows affected.

[('cuisinecode', 'integer'), ('codedesc', 'text')]

### Submission format

For all questions other than the first, the grader is expecting a table of results.  This can be in the form of a Python list of lists or a DataFrame.  The output format of the SQL magic (that is, cells that start with `%%sql`) is also accepted by the grader.

Recall that in IPython notebooks, the output of the previously-run cell is stored in the variable `_`.  We can capture the output of the previous query, for example by running:

In [6]:
result = _

This object can be indexed or iterated, and thus your answer can be built.

In [7]:
result[0][0]

'cuisinecode'

If your query produces output of the right shape, you can submit this full result direct to the grader without any intermediate steps.

**Note:** All questions have a placeholder solution provided to demonstrate the correct shape for your answer.  Be sure to submit the answer you've computed, not the placeholder!

**Warning:** If any returned query has thousands of rows, you run the risk of your browser locking up. To prevent your browser from locking up, use `LIMIT` to control the number of records that are returned and displayed.

### Aside: How we loaded the data

As you may notice, the original data come in CSV files.  There are a number of ways to load CSV files into a SQL database; we'll demonstrate a few here.  For concreteness, let's suppose we have a CSV file `sample.csv` with the following contents:
```
Name,Age
Alice,3
Bob,10
```

SQLite has a convenient [`.import` function](https://sqlite.org/cli.html#csv_import) which can create tables from `.csv` files.

```bash
sqlite> .import sample.csv sample
sqlite> SELECT * FROM sample;
```

In PostgreSQL, you need to create a table and then [copy](https://www.postgresql.org/docs/current/app-psql.html#APP-PSQL-META-COMMANDS-COPY) the data into it.
```
postgres=> CREATE TABLE sample (name TEXT, age INT);
postgres=> \copy sample FROM 'sample.csv' WITH CSV HEADER;
```

Alternatively, you can also read CSV files using pandas and convert that into SQL via some [SQL magic](https://github.com/catherinedevlin/ipython-sql#pandas).

```python
import pandas as pd

%load_ext sql
%sql sqlite:///sample.db

sample = pd.read_csv('sample.csv')
    
%sql DROP TABLE IF EXISTS sample;
%sql --persist sample
%sql SELECT * FROM sample;
```

Note that many CSV files contain badly formatted text.  Unfortunately, this is all too common.  The [`iconv`](https://linux.die.net/man/1/iconv) utility can convert files between different text encodings, and tools like [`awk`](https://linux.die.net/man/1/awk) and [`sed`](https://linux.die.net/man/1/sed) are useful for text transformation operations.

## Question 1: Null entries

Return the number of inspections (`CAMIS`, `INSPDATE` pairs) that do not have a score - i.e. where none of the rows with those (`CAMIS`, `INSPDATE`) values has a score. Remove the corresponding rows from the data set for the rest of the questions in the assignment.

As an example we might see this:

```sql
SELECT CAMIS, INSPDATE, SCORE
FROM webextract
ORDER BY CAMIS, INSPDATE
LIMIT 10;
```

| `CAMIS` | `INSPDATE` | `SCORE` |
| --- | --- | --- |
| 30075445 | 2011-03-10 00:00:00 | 14.0 |
| 30075445 | 2011-03-10 00:00:00 | 14.0 |
| 30075445 | 2011-03-10 00:00:00 | 14.0 |
| 30075445 | 2011-03-10 00:00:00 | None |
| 30075445 | 2011-04-27 00:00:00 | None |
| 30075445 | 2011-11-12 00:00:00 | None |
| 30075445 | 2011-11-12 00:00:00 | None |
| 30075445 | 2011-11-23 00:00:00 | 9.0 |
| 30075445 | 2011-11-23 00:00:00 | 9.0 |
| 30075445 | 2011-11-23 00:00:00 | 9.0 |

We want to filter only those dates for a given `CAMIS` where _every_ score is NULL (or `None` in the Python output).  In this case, we would remove 2011-04-27 and 2011-11-12, but keep 2011-03-10 (and 2011-11-23, of course).  Our post-filtering table would be:

| `CAMIS` | `INSPDATE` | `SCORE` |
| --- | --- | --- |
| 30075445 | 2011-03-10 00:00:00 | 14.0 |
| 30075445 | 2011-03-10 00:00:00 | 14.0 |
| 30075445 | 2011-03-10 00:00:00 | 14.0 |
| 30075445 | 2011-03-10 00:00:00 | None |
| 30075445 | 2011-11-23 00:00:00 | 9.0 |
| 30075445 | 2011-11-23 00:00:00 | 9.0 |
| 30075445 | 2011-11-23 00:00:00 | 9.0 |

**Question:** How else might we have handled this?

...

## Question 2: Score by ZIP code

...

## Question 3: Score by borough

Return a list of tuples of the form:

    (borough, mean score, number of restaurants)

for each of the city's five boroughs. Use the latest score for each restaurant. Sort the list in ascending order by the mean score.

**Hint:** You will have to perform a join with the `boroughs` table. The borough names should be reported in ALL CAPS.

**Checkpoint:**
- Total restaurants in valid boroughs: 24,350

In [21]:
%%sql 

SELECT * FROM filtered_webextract
LEFT OUTER JOIN boroughs
ON filtered_webextract.boro = boroughs.id
LIMIT 10

 * postgresql://docker:***@nycinspection.tditrain.com:5433/NYCinspection
10 rows affected.

[(41453658, "JUSTINO'S PIZZERIA", 1, '879-883 ', '10 AVENUE', '10019', '2125821222', 63, datetime.datetime(2011, 12, 22, 0, 0), 'F', '06D', 49, None, None, datetime.datetime(2014, 9, 4, 6, 1, 28, 403000), 1, 'MANHATTAN'),
 (41453658, "JUSTINO'S PIZZERIA", 1, '879-883 ', '10 AVENUE', '10019', '2125821222', 63, datetime.datetime(2012, 6, 11, 0, 0), 'F', '06D', 41, None, None, datetime.datetime(2014, 9, 4, 6, 1, 28, 403000), 1, 'MANHATTAN'),
 (41453658, "JUSTINO'S PIZZERIA", 1, '879-883 ', '10 AVENUE', '10019', '2125821222', 63, datetime.datetime(2013, 1, 17, 0, 0), 'G', '06C', 49, None, None, datetime.datetime(2014, 9, 4, 6, 1, 28, 403000), 1, 'MANHATTAN'),
 (41453658, "JUSTINO'S PIZZERIA", 1, '879-883 ', '10 AVENUE', '10019', '2125821222', 63, datetime.datetime(2013, 5, 30, 0, 0), 'P', '02G', 10, None, None, datetime.datetime(2014, 9, 4, 6, 1, 28, 403000), 1, 'MANHATTAN'),
 (41453811, 'THE POINT CAFE & GRILL', 2, '402', 'HUNTS POINT AVE', '10474', '7185897777', 27, datetime.datetime(2012, 10, 17, 0, 0), 'F', '04L', 9, None, None, datetime.datetime(2014, 9, 4, 6, 1, 28, 403000), 2, 'THE BRONX'),
 (41453811, 'THE POINT CAFE & GRILL', 2, '402', 'HUNTS POINT AVE', '10474', '7185897777', 27, datetime.datetime(2013, 5, 29, 0, 0), 'F', '08A', 27, 'B', datetime.datetime(2013, 5, 29, 0, 0), datetime.datetime(2014, 9, 4, 6, 1, 28, 403000), 2, 'THE BRONX'),
 (41453821, 'TRIPLE SHOT WORLD ATLAS', 1, '3739      ', 'CLINTON STREET                                    ', '10002', '7187827470', 14, datetime.datetime(2013, 3, 18, 0, 0), 'D', '09C', 9, 'A', datetime.datetime(2013, 3, 18, 0, 0), datetime.datetime(2014, 9, 4, 6, 1, 28, 403000), 1, 'MANHATTAN'),
 (41561941, 'DO DOMPA', 1, '71        ', 'CLINTON STREET                                                                                      ', '10002', '2125334781', 49, datetime.datetime(2012, 3, 27, 0, 0), 'B', None, None, None, None, datetime.datetime(2014, 9, 4, 6, 1, 28, 403000), 1, 'MANHATTAN'),
 (41561941, 'DO DOMPA', 1, '71        ', 'CLINTON STREET                                                                                      ', '10002', '2125334781', 49, datetime.datetime(2012, 10, 2, 0, 0), 'U', '10F', 12, 'A', datetime.datetime(2012, 10, 2, 0, 0), datetime.datetime(2014, 9, 4, 6, 1, 28, 403000), 1, 'MANHATTAN'),
 (41561941, 'DO DOMPA', 1, '71        ', 'CLINTON STREET                                                                                      ', '10002', '2125334781', 49, datetime.datetime(2014, 1, 14, 0, 0), 'D', '10F', 12, 'A', datetime.datetime(2014, 1, 14, 0, 0), datetime.datetime(2014, 9, 4, 6, 1, 28, 403000), 1, 'MANHATTAN')]

In [22]:
%%sql

SELECT SUM(count_camis)
FROM
    (SELECT boro, COUNT(DISTINCT camis) AS count_camis FROM filtered_webextract
     WHERE boro IN ('1', '2', '3', '4', '5')
     GROUP BY boro) AS foo

 * postgresql://docker:***@nycinspection.tditrain.com:5433/NYCinspection
1 rows affected.

[(Decimal('24350'),)]

In [23]:
%%sql

WITH camis_temp_table AS
(
    SELECT DISTINCT a.zipcode, a.camis, a.inspdate, b.maxdate, a.score, a.boro
    FROM filtered_webextract a
    INNER JOIN (
        SELECT zipcode, camis, MAX(inspdate) AS maxdate
        FROM filtered_webextract
        GROUP BY zipcode, camis
    ) b ON a.zipcode = b.zipcode AND a.camis = b.camis AND a.inspdate = b.maxdate
)

SELECT * FROM camis_temp_table

LIMIT 10

 * postgresql://docker:***@nycinspection.tditrain.com:5433/NYCinspection
10 rows affected.

[('07005', 41722563, datetime.datetime(2014, 4, 18, 0, 0), datetime.datetime(2014, 4, 18, 0, 0), 11, 0),
 ('10000', 41308044, datetime.datetime(2014, 7, 7, 0, 0), datetime.datetime(2014, 7, 7, 0, 0), 13, 1),
 ('10001', 40364149, datetime.datetime(2013, 9, 16, 0, 0), datetime.datetime(2013, 9, 16, 0, 0), 7, 1),
 ('10001', 40365882, datetime.datetime(2014, 5, 12, 0, 0), datetime.datetime(2014, 5, 12, 0, 0), 11, 1),
 ('10001', 40365882, datetime.datetime(2014, 5, 12, 0, 0), datetime.datetime(2014, 5, 12, 0, 0), None, 1),
 ('10001', 40366379, datetime.datetime(2014, 8, 15, 0, 0), datetime.datetime(2014, 8, 15, 0, 0), 12, 1),
 ('10001', 40367179, datetime.datetime(2014, 7, 1, 0, 0), datetime.datetime(2014, 7, 1, 0, 0), 10, 1),
 ('10001', 40370146, datetime.datetime(2013, 11, 8, 0, 0), datetime.datetime(2013, 11, 8, 0, 0), 5, 1),
 ('10001', 40372523, datetime.datetime(2013, 10, 10, 0, 0), datetime.datetime(2013, 10, 10, 0, 0), 9, 1),
 ('10001', 40372944, datetime.datetime(2014, 2, 3, 0, 0), datetime.datetime(2014, 2, 3, 0, 0), 7, 1)]

In [24]:
%%sql

WITH camis_temp_table AS
(
    SELECT DISTINCT a.zipcode, a.camis, a.inspdate, b.maxdate, a.score, a.boro
    FROM filtered_webextract a
    INNER JOIN (
        SELECT zipcode, camis, MAX(inspdate) AS maxdate
        FROM filtered_webextract
        GROUP BY zipcode, camis
    ) b ON a.zipcode = b.zipcode AND a.camis = b.camis AND a.inspdate = b.maxdate
)

SELECT name, AVG(score), COUNT(DISTINCT camis)
FROM
    (
     SELECT name, score, camis, MAX(inspdate)
     FROM camis_temp_table 
     LEFT OUTER JOIN boroughs
     ON camis_temp_table.boro = boroughs.id
     GROUP BY name, score, camis
    ) AS foo
WHERE name IN ('THE BRONX', 'MANHATTAN', 'BROOKLYN', 'STATEN ISLAND', 'QUEENS')
GROUP BY name 
ORDER BY AVG(score)

 * postgresql://docker:***@nycinspection.tditrain.com:5433/NYCinspection
5 rows affected.

[('THE BRONX', Decimal('10.7130004498425551'), 2281),
 ('MANHATTAN', Decimal('11.3905436367423453'), 9891),
 ('BROOKLYN', Decimal('11.5136428065201984'), 5849),
 ('STATEN ISLAND', Decimal('11.7542857142857143'), 912),
 ('QUEENS', Decimal('11.7667864573482126'), 5417)]

In [25]:
score_by_borough = _

In [26]:
# score_by_borough = [("MANHATTAN", 11.48963704377717, 9891)] * 5

grader.score('sql__score_by_borough', score_by_borough)

==================
Your score: 1.0000
==================

## Question 4: Violations by cuisine

...

## Question 5: Specific violations by cuisine

...

*Copyright &copy; 2022 Pragmatic Institute. This content is licensed solely for personal use. Redistribution or publication of this material in whole is strictly prohibited.*